cmsis-svd/cmsis-svd/data/SiliconLabs/EZR32HG320F64R63.svd
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE14</name>
              <description>Pin 14 Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE15</name>
              <description>Pin 15 Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_DOUT</name>
          <description>Port Data Out Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_DOUTSET</name>
          <description>Port Data Out Set Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DOUTSET</name>
              <description>Data Out Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_DOUTCLR</name>
          <description>Port Data Out Clear Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DOUTCLR</name>
              <description>Data Out Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_DOUTTGL</name>
          <description>Port Data Out Toggle Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DOUTTGL</name>
              <description>Data Out Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_DIN</name>
          <description>Port Data In Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DIN</name>
              <description>Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_PINLOCKN</name>
          <description>Port Unlocked Pins Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PINLOCKN</name>
              <description>Unlocked Pins</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_CTRL</name>
          <description>Port Control Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>DRIVEMODE</name>
              <description>Drive Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD</name>
                  <description>6 mA drive current</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <description>0.1 mA drive current</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>20 mA drive current</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>1 mA drive current</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
